# Week4: Getting Started with Pandas

In [ ]:
import pandas as pd
import numpy as np

From this point, Pandas will be the main library we will use to study our data and apply machine learning algorithms. Pandas inherits significant parts of NumPy's idiomatic style of array based computing. Unlike numpy, Pandas allows for heterogeneous data. 

Pandas is built around 2 main data structures: __Series__ and __DataFrames__. A __Series__ could be seen as a simple one dimentional array like object with a sequence of values along with an associated array of labels also known as index.

In [2]:
s_1  = pd.Series([3,4,67,1])

In [4]:
s_1

0     3
1     4
2    67
3     1
dtype: int64

In [5]:
type(s_1)

pandas.core.series.Series

In [6]:
s_1.values

array([ 3,  4, 67,  1])

In [8]:
type(s_1.values)

numpy.ndarray

In [9]:
s_1.index

RangeIndex(start=0, stop=4, step=1)

In some cases you would want to create a Series with a specific index identifying each data point:

In [73]:
s_2 = pd.Series([0,1,4,2,5],index=['blue','black','yellow','red','white'])

In [74]:
s_2

blue      0
black     1
yellow    4
red       2
white     5
dtype: int64

In [75]:
s_2.index

Index(['blue', 'black', 'yellow', 'red', 'white'], dtype='object')

Indexing works beautifully with Series objects:

In [76]:
s_2['white']

5

In [77]:
s_2[['red','yellow']] # Note we are using fancy indexing here... The output is another Serie

red       2
yellow    4
dtype: int64

Similarly boolean indexing is very handy with Series.

In [30]:
s_2[s_2==1]

black    1
dtype: int64

Applying scar multiplication and math funcion work as well:

In [31]:
s_2 *3

blue       0
black      3
yellow    12
red        6
white     15
dtype: int64

In [32]:
np.exp(s_2)

blue        1.000000
black       2.718282
yellow     54.598150
red         7.389056
white     148.413159
dtype: float64

A Series could also be used in a similar way to how we used dictionaries:

In [34]:
'red' in s_2

True

This also means that if we convert easily a dictionnary into a Series:

In [35]:
my_dict = {'Tony':36,'James':42,'Rebecca':26}

In [37]:
my_s = pd.Series(my_dict)
my_s

Tony       36
James      42
Rebecca    26
dtype: int64

The key defaulted to the index here but if we want to override this by passing dict keys in the order you them to appear in:

In [40]:
names = ['Sarah','Rebecca','James']

In [41]:
my_s2 = pd.Series(my_dict, index=names)

In [42]:
my_s2

Sarah       NaN
Rebecca    26.0
James      42.0
dtype: float64

Notice that the two values found in my_dict were placed in the appropriate locations, but since no value for 'Sarah' was found, it appears as NaN (not a number),which is considered in pandas to mark missing or NA values. Since 'Tony' was not included within the list of names, it does not apprear in the output Series. The isnull and notnull functions in pandas should be used to detect missing data:

In [43]:
pd.isnull(my_s2)

Sarah       True
Rebecca    False
James      False
dtype: bool

In [44]:
pd.notnull(my_s2)

Sarah      False
Rebecca     True
James       True
dtype: bool

Those two methods could be applied directly to the corresponding Series objects:

In [47]:
my_s2.isnull()

Sarah       True
Rebecca    False
James      False
dtype: bool

What happens when we apply arithmetic operations on series?

In [48]:
my_s + my_s2

James      84.0
Rebecca    52.0
Sarah       NaN
Tony        NaN
dtype: float64

Name attributes could be assigned to the Series values and index:

In [78]:
my_s.name='Age'

In [79]:
my_s.index.name='Employee'

In [80]:
my_s

Employee
Simon    36
Lara     42
Mary     26
Name: Age, dtype: int64

A series index can always be altered in-place by assignement:

In [81]:
my_s.index=['Simon','Lara','Mary']

In [82]:
my_s

Simon    36
Lara     42
Mary     26
Name: Age, dtype: int64

### Index Objects

Pandas's index objects are deisgned to contain the information of the axis labels og the table. Earlier we saw the default index based on a range function but any array of labels could be as well assigned to an index.

In [86]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [87]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [88]:
index[1:]

Index(['b', 'c'], dtype='object')

notice that index objects are immutable. It is designed that way to make safer when it shared among several data structures.

In [89]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [90]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [91]:
obj2.index is labels

True

Pandas indexes can contain dupicate labels:

In [92]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

__reindexing__ is an important method that is provided by Pandas. It allows to rearrange the rows of the DataFrame. In case a new label is provided the corresponding value will default to NaN.

In [11]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [12]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

An interesting feature of __reindex__ method is to use the ffill optional argument that allows for some sort of an interpolation in the case of missing values.

In [13]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [14]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

## DataFrame

A DataFrame constitute a table of data containing an ordered and indexed set of columns and rows. It could seen as a collection of Series or a two dimentional Series. Like a Serie, there are many ways to create a DataFrame.

In [94]:
data={'state':['New York','New York','Alabama','Alabama','Alabama','Alabama'],'year':[2000,2001,2001,2002,2003,2004],'rank':[10,12,3,11,5,8]}
data

{'state': ['New York', 'New York', 'Alabama', 'Alabama', 'Alabama', 'Alabama'],
 'year': [2000, 2001, 2001, 2002, 2003, 2004],
 'rank': [10, 12, 3, 11, 5, 8]}

In [95]:
frame = pd.DataFrame(data)

In [96]:
frame

      state  year  rank
0  New York  2000    10
1  New York  2001    12
2   Alabama  2001     3
3   Alabama  2002    11
4   Alabama  2003     5
5   Alabama  2004     8

In the abscence of explicit index specification pandas automatically assigns a range index as we saw in Seriesv

In [97]:
frame.head() #selects and shows the first five rows

      state  year  rank
0  New York  2000    10
1  New York  2001    12
2   Alabama  2001     3
3   Alabama  2002    11
4   Alabama  2003     5

In [98]:
pd.DataFrame(data,columns=['year','state','rank']) # the dataframe created with columns in that order

   year     state  rank
0  2000  New York    10
1  2001  New York    12
2  2001   Alabama     3
3  2002   Alabama    11
4  2003   Alabama     5
5  2004   Alabama     8

And for specifying in the index:

In [99]:
frame_2 = pd.DataFrame(data,columns=['year','state','rank'],index=['a','b','c','d','e','f'])

In [100]:
frame_2

   year     state  rank
a  2000  New York    10
b  2001  New York    12
c  2001   Alabama     3
d  2002   Alabama    11
e  2003   Alabama     5
f  2004   Alabama     8

In [101]:
frame_2.columns

Index(['year', 'state', 'rank'], dtype='object')

In [102]:
frame_2['state']

a    New York
b    New York
c     Alabama
d     Alabama
e     Alabama
f     Alabama
Name: state, dtype: object

In [103]:
frame_2.state

a    New York
b    New York
c     Alabama
d     Alabama
e     Alabama
f     Alabama
Name: state, dtype: object

In [104]:
type(frame_2.state)

pandas.core.series.Series

### Different ways to create DataFrame

![DataFrame](Dataframe.jpeg)

### Reindexing

In [105]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [106]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [107]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

The __drop__ method allows you to drop a data entry as per below:

In [108]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [109]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

__drop__ method works with both columns and rows as illustrated below:

In [21]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [24]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In case you want to drop the data without assigning it to a new DataFrame the optional kew argument __inplace__=True can be invoked as below (Be carefull with __inplace__, as it destroys any data that is dropped:

In [25]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

![Methods](Pandas_methods.jpeg)

### Indexing, Selection, and Filtering

Series indexing ( obj[...] )
works similarly to NumPy array indexing, except you can use
the Seriesâ€™s index values instead of only integers. Here are some
examples of this:

In [26]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [27]:
obj['b']

1.0

In [28]:
obj[1]

1.0

In [29]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [30]:

obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [31]:

obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [32]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

 #### Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive:

In [110]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Values could be changed using the below familiar way, also known as broadcasting:

In [112]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
e    4.0
dtype: float64

Indexing into a Dataframe allows the extraction of one or more columns. This is done by retreiving a single value or a sequence:

In [113]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [114]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [115]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Indexing like this has a few special cases. First, slicing or
selecting data with a boolean array:

In [116]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [43]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided
as a convenience. Passing a single element or a list to the
[] operator selects columns. Another use case is in indexing with a boolean DataFrame, such as
one produced by a scalar comparison:

In [46]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [47]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

For DataFrame label-indexing on the rows, I introduce the
special indexing operators loc and
iloc . They enable you to select a subset of the
rows and columns from a DataFrame with NumPy-like notation using
either axis labels ( loc ) or integers
( iloc ). As a preliminary example, letâ€™s select a single row and multiple
columns by label:

In [49]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [50]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [51]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [52]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Similarly we can work with slicing as below:

In [53]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [54]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

As you can see DataFrame provides few different away to select and extract data for the table. TableÂ below provides a short summary of many of them. Moreover we will see many additional options for working with hierarchical indexes.

![indexing](indexing.jpeg)

### Integer Indexes

Working with pandas objects indexed by integers is something that often trips
up new users due to some differences with indexing semantics on built-in
Python data structures like lists
and tuples. For example, you might not expect the following code to
generate an error:

In [120]:
ser = pd.Series(np.arange(3.))

In [121]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [119]:
ser[-1]

KeyError: -1

In this case, pandas could â€œfall backâ€ on integer indexing, but
itâ€™s difficult to do this in general without introducing subtle bugs.
Here we have an index containing 0, 1, 2, but inferring what the user
wants (label-based indexing or position-based) is difficult: 
On the other hand, with a non-integer index, there is no potential
for ambiguity:

In [124]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [125]:
ser2[-1]

2.0

In [123]:
ser[:1]

0    0.0
dtype: float64

In [71]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [72]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

 When you are adding together
two DataFrames, if any index pairs are not the same, the respective index in
the result will be the union of the index pairs.

In [74]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [75]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [76]:

s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [77]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label
locations that donâ€™t overlap. Missing values will then propagate in
further arithmetic computations. In the case of DataFrame, alignment is performed on both the rows
and the columns:

In [79]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [80]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [81]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [82]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Obviously the columns 'c' and 'e'  are not found in both DataFrame objects, hence they appear as all
missing in the result. This also applies to the rows whose labels are not
common to both DataFrames. If you add two DataFrames with no column or row labels in
common, you expect the result to have only nulls:

In [87]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [88]:
df1

   A
0  1
1  2

In [89]:
df2

   B
0  3
1  4

In [90]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In case you want replace missing values with specific input:

In [130]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [131]:
df2.loc[1, 'b'] = np.nan

In [132]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [133]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [97]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [98]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

See TableÂ below for a listing of Series
and DataFrame methods for arithmetic. Each of them has a counterpart,
starting with the letter r , that has arguments
flipped. So these two statements are equivalent:

In [99]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [100]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

When reindexing a Series or DataFrame, you can also
specify a different fill value:

In [101]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

![indexing](pandas_method.jpeg)

#### Operations between DataFrame and Series

As with NumPy arrays of different dimensions, arithmetic between DataFrame and
Series is also defined. First, as a motivating example, consider the
difference between a two-dimensional array and one of its rows:

In [106]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [107]:
arr[0]

array([0., 1., 2., 3.])

In [108]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

When we subtract arr[0] from arr , the subtraction is performed once for each row. This is referred to as broadcasting and is explained in more detail as it relates to general NumPy arrays in AppendixÂ A . Operations between a DataFrame and a Series are similar:

In [136]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [137]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [138]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between DataFrame and Series matches the index of the Series on the DataFrameâ€™s columns, broadcasting down the
rows:

In [139]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found in either the DataFrameâ€™s columns
or the Seriesâ€™s index, the objects will be reindexed to form the
union:

In [143]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [144]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on
the rows, you have to use one of the arithmetic methods. For
example:

In [148]:
series3 = frame['d']

In [149]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [150]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [151]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

The axis number that you pass is the axis to match
on . In this case we mean to match on the DataFrameâ€™s row
index ( axis='index' or axis=0 )
and broadcast across.

### Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [ ]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [127]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [128]:
np.abs(frame)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Another frequent operation is applying a function on
one-dimensional arrays to each column or row. DataFrameâ€™s apply method does exactly this:

In [129]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    9.0
d    9.0
e    9.0
dtype: float64

In [130]:
frame.apply(f, axis='columns')

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

In [131]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

       b     d     e
min  0.0   1.0   2.0
max  9.0  10.0  11.0

In [152]:
formats = lambda x: '%.2f' % x
frame.applymap(formats)

           b      d      e
Utah    0.00   1.00   2.00
Ohio    3.00   4.00   5.00
Texas   6.00   7.00   8.00
Oregon  9.00  10.00  11.00

The reason for the name applymap is that Series has a map method for applying an element-wise function:

In [153]:
frame['e'].map(format)

Utah       2.0
Ohio       5.0
Texas      8.0
Oregon    11.0
Name: e, dtype: object

### Sorting and Ranking

Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns a new, sorted object:

In [140]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [141]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [142]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default, but can be
sorted in descending order, too:

In [144]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [146]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [148]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more
columns as the sort keys. To do so, pass one or more column names to the
by option of
sort_values :

In [150]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [151]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [152]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the
number of valid data points in an array. The rank methods for
Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the
mean rank:

In [155]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [156]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which theyâ€™re
observed in the data:

In [154]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

You can rank in descending order, too:

In [157]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [159]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [160]:

frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

Up until now all of the examples weâ€™ve looked at have had unique axis labels (index values).
While many pandas functions (like reindex ) require that the labels be unique,
itâ€™s not mandatory. Letâ€™s consider a small Series with duplicate indices:

In [161]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [162]:
obj.index.is_unique

False

Data selection is one of the main things that behaves differently with duplicates.
Indexing a label with multiple entries returns a Series, while single
entries return a scalar value:

In [168]:
obj['a']

a    0
a    1
dtype: int64

In [169]:
obj['c']

4

This can make your code more complicated, as the output type from
indexing can vary based on whether a label is repeated or not. The same logic extends to indexing rows in a DataFrame:

In [170]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [171]:
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [172]:
df.loc['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and Computing Descriptive Statistics

Pandas objects are equipped with a set of common mathematical and statistical
methods. Most of these fall into the category of
reductions or summary
statistics , methods that extract a single value (like the sum
or mean) from a Series or a Series of values from the rows or columns of a
DataFrame. Compared with the similar methods found on NumPy arrays, they
have built-in handling for missing data. Consider a small
DataFrame:

In [173]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [174]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [175]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [176]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [177]:
df.idxmax()

one    b
two    d
dtype: object

In [181]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [182]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

Another type of method is neither a reduction nor an accumulation.
describe is one such example, producing
multiple summary statistics in one shot. On non-numeric data, describe produces alternative summary statistics:

In [184]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

![stat](stats_methods.jpeg)

### Correlation and Covariance

Some summary statistics, like correlation and covariance, are computed from pairs
of arguments. Letâ€™s consider some DataFrames of stock prices and volumes
obtained from Yahoo! Finance using the add-on
pandas-datareader package. If you donâ€™t have it installed already, it can be obtained
via conda or pip:

conda install pandas-datareader

In [191]:
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')

In [193]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [194]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-12-02 -0.011562 -0.011454 -0.012089 -0.011525
2019-12-03 -0.017830 -0.005944 -0.001605  0.004155
2019-12-04  0.008826 -0.000984  0.003617  0.019502
2019-12-05  0.014671 -0.000606  0.000534  0.005748
2019-12-06  0.019316  0.009931  0.012139  0.009404

In [197]:
returns['MSFT'].corr(returns['IBM'])

0.48890585070352666

In [198]:
returns['MSFT'].cov(returns['IBM'])

9.424377023544941e-05

In [199]:
returns.MSFT.corr(returns.IBM)

0.48890585070352666

In [200]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.406527  0.575754  0.524823
IBM   0.406527  1.000000  0.488906  0.414964
MSFT  0.575754  0.488906  1.000000  0.660647
GOOG  0.524823  0.414964  0.660647  1.000000

In [201]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000247  0.000083  0.000133  0.000125
IBM   0.000083  0.000170  0.000094  0.000082
MSFT  0.000133  0.000094  0.000218  0.000148
GOOG  0.000125  0.000082  0.000148  0.000231

Using DataFrameâ€™s corrwith method, you can compute pairwise correlations between a
DataFrameâ€™s columns or rows with another Series or DataFrame. Passing a
Series returns a Series with the correlation value computed for each
column:

In [202]:
returns.corrwith(returns.IBM)

AAPL    0.406527
IBM     1.000000
MSFT    0.488906
GOOG    0.414964
dtype: float64

In [203]:
returns.corrwith(volume)

AAPL   -0.118027
IBM    -0.133745
MSFT   -0.086157
GOOG   -0.005329
dtype: float64

### Unique Values, Value Counts, and Membership

Another class of related methods extracts information about the values contained in
a one-dimensional Series. To illustrate these, consider this
example:

In [204]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [205]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [206]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [207]:
pd.value_counts(obj.values, sort=False)

a    3
b    2
c    3
d    1
dtype: int64

In [ ]:
obj
mask = obj.isin(['b', 'c'])
mask
obj[mask]

In [ ]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

In [ ]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

In [ ]:
result = data.apply(pd.value_counts).fillna(0)
result

# Exercises

Write a Python program to convert a Panda module Series to Python list and it's type.

Write a Python program to add, subtract, multiple and divide two Pandas Series. Go to the editor
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [1]:
import pandas as pd
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)

In [2]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [ ]:
Write a Pandas program to insert a new column in existing DataFrame